redbear/STM32-Arduino/arduino/boards.txt
# RedBear Duo (Native USB Port)
# ---------------------------------------
RedBear_Duo_native.name=RedBear Duo (Native USB Port)

RedBear_Duo_native.upload.tool=avrdude
RedBear_Duo_native.upload.protocol=avr109
RedBear_Duo_native.upload.maximum_size=262144
RedBear_Duo_native.upload.speed=19200
RedBear_Duo_native.upload.disable_flushing=true
RedBear_Duo_native.upload.use_1200bps_touch=true
RedBear_Duo_native.upload.wait_for_upload_port=true

RedBear_Duo_native.build.mcu=cortex-m3
RedBear_Duo_native.build.f_cpu=120000000
RedBear_Duo_native.build.usb_product="Arduino RBL"
RedBear_Duo_native.build.board=RedBear_Duo
RedBear_Duo_native.build.core=RedBear_Duo
RedBear_Duo_native.build.variant=RedBear_Duo
RedBear_Duo_native.build.extra_flags=-mthumb
RedBear_Duo_native.build.ldscript=linker_scripts/gcc/duo/user-part/linker.ld
RedBear_Duo_native.build.ld_include1="-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/gcc/duo/system-part1" "-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/gcc/duo/system-part2" "-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/gcc/duo/user-part" "-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/gcc/shared/stm32f2xx" 
RedBear_Duo_native.build.ld_include2="-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/linker"
RedBear_Duo_native.build.ld_include3="-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/linker/stm32f2xx"
RedBear_Duo_native.build.variant_base_include="-I{build.system.path}/CMSIS/CMSIS/Include" "-I{build.core.path}/redbear_sdk" "-I{build.core.path}/redbear_sdk/A_user/inc" "-I{build.core.path}/redbear_sdk/E_rt-dynalib/inc" "-I{build.core.path}/redbear_sdk/F_wiring/inc" "-I{build.core.path}/redbear_sdk/H_platform/shared/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/shared/STM32/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/STM32F2xx/STM32_StdPeriph_Driver/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/STM32F2xx/SPARK_Firmware_Driver/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/STM32F2xx/STM32_USB_Device_Driver/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/STM32F2xx/STM32_USB_OTG_Driver/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/STM32F2xx/CMSIS/Device/ST/Include" "-I{build.core.path}/redbear_sdk/I_modules/duo/user-part/inc" "-I{build.core.path}/redbear_sdk/I_modules/shared/stm32f2xx/inc"
RedBear_Duo_native.build.variant_extra_include="-I{build.core.path}/redbear_sdk/X_define" "-I{build.core.path}/redbear_sdk/X_hal/inc" "-I{build.core.path}/redbear_sdk/X_hal/shared" "-I{build.core.path}/redbear_sdk/X_hal/src/stm32f2xx" "-I{build.core.path}/redbear_sdk/X_hal/src/stm32" "-I{build.core.path}/redbear_sdk/X_hal/src/duo" "-I{build.core.path}/redbear_sdk/X_hal/src/duo/include" "-I{build.core.path}/redbear_sdk/X_hal/src/duo/libraries/btstack/port" "-I{build.core.path}/redbear_sdk/X_hal/src/duo/libraries/btstack/src" "-I{build.core.path}/redbear_sdk/X_hal/src/duo/libraries/btstack/src/ble" "-I{build.core.path}/redbear_sdk/X_hal/src/duo/libraries/btstack/src/classic" "-I{build.core.path}/redbear_sdk/X_services/inc" "-I{build.core.path}/redbear_sdk/X_system/inc" "-I{build.core.path}/redbear_sdk/X_communication/src" "-I{build.core.path}/redbear_sdk/X_dynalib/inc" "-I{build.core.path}/redbear_sdk/X_lib"

RedBear_Duo_native.bootloader.tool=fw_loader


# RedBear Duo (RBLink USB Port)
# ---------------------------------------
RedBear_Duo.name=RedBear Duo (RBLink USB Port)
RedBear_Duo.vid.0=0x0483
RedBear_Duo.pid.0=0x374B

RedBear_Duo.upload.tool=openocd
RedBear_Duo.upload.protocol=
RedBear_Duo.upload.maximum_size=262144
RedBear_Duo.upload.use_1200bps_touch=false
RedBear_Duo.upload.wait_for_upload_port=false
RedBear_Duo.upload.native_usb=false

RedBear_Duo.build.mcu=cortex-m3
RedBear_Duo.build.f_cpu=120000000
RedBear_Duo.build.usb_product="Arduino RBL"
RedBear_Duo.build.board=RedBear_Duo
RedBear_Duo.build.core=RedBear_Duo
RedBear_Duo.build.variant=RedBear_Duo
RedBear_Duo.build.extra_flags=-mthumb
RedBear_Duo.build.ldscript=linker_scripts/gcc/duo/user-part/linker.ld
RedBear_Duo.build.ld_include1="-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/gcc/duo/system-part1" "-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/gcc/duo/system-part2" "-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/gcc/duo/user-part" "-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/gcc/shared/stm32f2xx" 
RedBear_Duo.build.ld_include2="-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/linker"
RedBear_Duo.build.ld_include3="-L{runtime.platform.path}/variants/RedBear_Duo/linker_scripts/linker/stm32f2xx"
RedBear_Duo.build.variant_base_include="-I{build.system.path}/CMSIS/CMSIS/Include" "-I{build.core.path}/redbear_sdk" "-I{build.core.path}/redbear_sdk/A_user/inc" "-I{build.core.path}/redbear_sdk/E_rt-dynalib/inc" "-I{build.core.path}/redbear_sdk/F_wiring/inc" "-I{build.core.path}/redbear_sdk/H_platform/shared/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/shared/STM32/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/STM32F2xx/STM32_StdPeriph_Driver/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/STM32F2xx/SPARK_Firmware_Driver/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/STM32F2xx/STM32_USB_Device_Driver/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/STM32F2xx/STM32_USB_OTG_Driver/inc" "-I{build.core.path}/redbear_sdk/H_platform/MCU/STM32F2xx/CMSIS/Device/ST/Include" "-I{build.core.path}/redbear_sdk/I_modules/duo/user-part/inc" "-I{build.core.path}/redbear_sdk/I_modules/shared/stm32f2xx/inc"
RedBear_Duo.build.variant_extra_include="-I{build.core.path}/redbear_sdk/X_define" "-I{build.core.path}/redbear_sdk/X_hal/inc" "-I{build.core.path}/redbear_sdk/X_hal/shared" "-I{build.core.path}/redbear_sdk/X_hal/src/stm32f2xx" "-I{build.core.path}/redbear_sdk/X_hal/src/stm32" "-I{build.core.path}/redbear_sdk/X_hal/src/duo" "-I{build.core.path}/redbear_sdk/X_hal/src/duo/include" "-I{build.core.path}/redbear_sdk/X_hal/src/duo/libraries/btstack/port" "-I{build.core.path}/redbear_sdk/X_hal/src/duo/libraries/btstack/src" "-I{build.core.path}/redbear_sdk/X_hal/src/duo/libraries/btstack/src/ble" "-I{build.core.path}/redbear_sdk/X_hal/src/duo/libraries/btstack/src/classic" "-I{build.core.path}/redbear_sdk/X_services/inc" "-I{build.core.path}/redbear_sdk/X_system/inc" "-I{build.core.path}/redbear_sdk/X_communication/src" "-I{build.core.path}/redbear_sdk/X_dynalib/inc" "-I{build.core.path}/redbear_sdk/X_lib"
RedBear_Duo.build.openocdscript=openocd_scripts/redbear_duo.cfg

RedBear_Duo.bootloader.tool=openocd
RedBear_Duo.bootloader.bootloader_file=bootloader.bin
RedBear_Duo.bootloader.bootloader_loc=0x8000000
RedBear_Duo.bootloader.system_part1_file=duo-system-part1.bin
RedBear_Duo.bootloader.system_part1_loc=0x8020000
RedBear_Duo.bootloader.system_part2_file=duo-system-part2.bin
RedBear_Duo.bootloader.system_part2_loc=0x8040000
RedBear_Duo.bootloader.user_part_file=duo-user-part.bin
RedBear_Duo.bootloader.user_part_loc=0x80c0000
